{
	"id": {
		"name": "Pedro Marquez",
		"role": "Full-stack Software Developer",
		"summary": "Full Stack developer, Java Architect and Certified Ethical Hacker.",
		"highlights":[
			"5+ years of experience in Java technologies (back-end).",
			"7+ years of experience in front-end technologies (JavaScript, CSS, HTML).",
			"2 years of experience in Application Security and Penetration Testing."
		],
		"contact":[
			{
				"icon":"github",
				"link":"https://github.com/pfernandom",
				"text":"Github"
			},
			{
				"icon":"linkedin",
				"link":"https://www.linkedin.com/in/pedro-fernando-m%C3%A1rquez-soto-1218a345/?locale=en_US",
				"text":"LinkedIn"
			},
			{
				"icon":"twitter",
				"link":"https://twitter.com/pfernandom",
				"text":"Twitter"
			},
			{
				"icon":"mail",
				"link":"mailto:pfernandom@gmail.com",
				"text":"pfernandom@gmail.com"
			},
			{
				"icon":"phone",
				"link":"tel:+5129039712",
				"text":"(512) 903-9712"
			}
		]
	},
	"roles":{
		"Java developer":["java","maven","git","rest","oauth","portlet","liferay","wps","backend"],
		"JavaScript developer": ["js","angular","reactjs","webpack","bootstrap","electron","ionic","jquery","extjs","aws-lambda",
			"responsive-design","rxjs","material","d3","react","ui"],
		"Full-stack developer":["java","maven","git","rest","oauth","portlet","liferay","wps","js","angular","reactjs","webpack",
			"bootstrap","electron","ionic","jquery","extjs","aws-lambda","responsive-design","rxjs","material","d3","react","ui"],
		"Security Analyst":["fortify","burp","app-sec","threat-modeling"]
	},
	"experience":[
		{
			"project": "Personal Projects",
			"startDate": "2015",
			"endDate": "Today",
			"role": "Software Developer",
			"description": "I like to learn new technologies and I'm constantly involved in learning and participate in hackathons. These are a few of the technologies I've tried outside my day job",
			"tags":[],
			"responsabilities": [
				{
					"categories":["aws","aws-rekognition","rabbitmq","golang"],
					"content":"Hackathon: Developed an application with Golang to retrieve photos from a Raspberry Pi and send them to AWS Rekognition for facial recognition"
				},
				{
					"categories":["ionic","serverless","aws","aws-lambda"],
					"content":"Hackathon: Developed an Ionic application for a Hackathon about Serverless applications. The mobile application consumed an AWS Lambda exposed through AWS API Gateway; and it provided a list of ratings for the latest movies in theaters"
				},
				{
					"categories":["serverless"],
					"content":"Created a blog about Serverless applications, hosted at Medium: https://medium.com/a-man-with-no-server. I'm building a Serverless application as an example, and documenting step by step in the blog"
				},
				{
					"categories":["electron","angular","git"],
					"content":"Built an Electron application, using Angular, to manage services hosted in a Docker Swarm cluster: https://github.com/pfernandom/electroswarm"
				},
				{
					"categories":["reactjs","webpack"],
					"content":"Used ReactJS, Redux and Webpack to build web applications (including this website)"
				},
				{
					"categories":["angular","d3","neo4j"],
					"content":"Hackathon: Developed an Angular application to visualize relationships between people stored in a Neo4J database, and displaying the data through a D3 data graph"
				}
			]
		},
		{
			"project": "Magellan (at Accenture)",
			"startDate": "Dec, 2017",
			"endDate": "Today",
			"role": "Senior Full-stack Developer",
			"description": "As a senior developer, I contribuite to create PaaS based applications using microservices over an AWS infrastructure. I mentor and help my teammates to complete their user stories successfully and in time. Also, I collaborate with the Architects team to improve the design of our cloud-based infrastructure, implement proofs of concept, document research results, and solve problems which appear during day-to-day development.",
			"tags":["java","nodejs","aws","docker","angular","wso-apimanager","rest","ci/cd","git","agile/scrum","paas","openshift","cloudfoundry","spring","reactjs","cloud","oauth","maven","rabbitmq","mongodb","bash","linux"],
			"responsabilities": [
				{
					"categories":["ui","react","rxjs","rest","backend","nodejs"],
					"content":"Built an internal ReactJS application with Redux and Rxjs (including it's REST API build in NodeJS with Restify) to execute and monitor build jobs in Jenkins"
				},
				{
					"categories":["devops","api-management","aws","rest","backend","java","linux"],
					"content":"Implemented and mantained a cluster of WSO2 products (over AWS EC2 instances running CentOS) including API Manager, Identity Server and Data Analytics"
				},
				{
					"categories":["devops","bash","linux"],
					"content":"Created Bash scripts to run as Cronjobs to synchronize configuration files with Rsync, and to guarantee the availability of servers running inside EC2 instances"
				},
				{
					"categories":["management","agile","backend","java","ui"],
					"content":"Worked under an Agile methodology (Scrum), acting as backup Scrum Master"
				},
				{
					"categories":["devops","aws","backend"],
					"content":"Troubleshooted infrastructure and networking issues on AWS services using EC2, Security Groups, ELB instances and Route 53"
				},
				{
					"categories":["devops","aws","backend"],
					"content":"Troubleshooted AWS services like RDS and Elasticache"
				},
				{
					"categories":["backend","spring","mongodb","mysql","database"],
					"content":"Maintained Spring Data repositories which connect to MySQL and MongoDB"
				},
				{
					"categories":["backend","rabbitmq"],
					"content":"Built microservices using RabbitMQ for asynchronous inter-service communication"
				},
				{
					"categories":["backend","java","java","spring","microservices","docker","maven"],
					"content":"Developed microservices using Spring Boot, Spring Cloud, Spring Data and Maven, which used Docker as a deployment unit"
				},
				{
					"categories":["backend","java","ci/cd","git","openshift","cloudfoundry"],
					"content":"Troubleshooted CI/CD pipelines implemented with Jenkins, which build the microservices in each commit to Git (BitBucket), packaging them in Docker and deploy them to both Openshift and CloudFoundry on the same pipeline."
				},
				{
					"categories":["devops","paas","openshift","cloudfoundry"],
					"content":"Created and maintained services in PaaS products like Openshift and CloudFoundry"
				},
				{
					"categories":["backend","java","ui", "spring"],
					"content":"Implemented Single-Sign-On clients for SAML 2.0 (with Spring Boot MVC) and OpenID Connect (with JavaScript)"
				},
				{
					"categories":["backend","java","api-management","rest","java"],
					"content":"Designed REST APIs implemented in Spring Boot and exposed them through the WSO2 API Manager"
				},
				{
					"categories":["ui","oauth","rest","app-sec", "angular"],
					"content":"Implemented an implicit OAuth2 grant, using the WSO2 Identity Server and AngularJS"
				},
				{
					"categories":["management","ui","backend","java"],
					"content":"Trained and mentored other developers in best practices of software development, debugging and infrastructure implementation"
				},
				{
					"categories":["backend","docker"],
					"content":"Built a proof of concept using Docker Swarm to run Docker-packaged microservices"
				}
			]
		},
		{
			"project": "ACSSP/REACH (at Accenture)",
			"startDate": "Dec, 2014",
			"endDate": "Dec 2016",
			"role": "Software Architect & Full-stack developer",
			"description": "As the software architect for ACSSP/REACH, I worked with the architects of the other H&PS SW products to implement new features and integrate with the other applications. I participated in the innovation initiative to bring new technologies to the product",
			"tags":["java","angular","liferay","wps","portlet","spring","maven","responsive-design","git","svn","oauth","bootstrap","material-design","rest"],
			"responsabilities": [
				{
					"categories":["management","agile","backend","java","ui"],
					"content":"Worked under an Agile methodology (Scrum), participating proactively during Sprint planning and retrospectives"
				},
				{
					"categories":["management","rest","oauth","backend","java"],
					"content":"Implemented best practices for building REST APIs to expose core functionality in the product. Also implemented OAuth2 for the authorization of those REST services"
				},
				{
					"categories":["management","oauth","backend","java"],
					"content":"Implemented best practices for building REST APIs to expose core functionality in the product"
				},
				{
					"categories":["management","backend","java"],
					"content":"Designed a project structure to help clients extend our product"
				},
				{
					"categories":["backend","java","portlet"],
					"content":"Analized and implemented portal servers like Liferay and Websphere Portal Server"
				},
				{
					"categories":["backend","java","management"],
					"content":"Analized and designed integration of new code modules with legacy code"
				},
				{
					"categories":["backend","java","ui","portlet","java","angular","spring"],
					"content":"Created Java Portlets using Maven, Spring Portlet MVC and AngularJS"
				},
				{
					"categories":["ui","angular","sass","bootstrap"],
					"content":"Created a library of reusable Angular components, using Bootstrap, Sass, Grunt"
				},
				{
					"categories":["ui","angular","testing"],
					"content":"Implemented unit tests for Angular modules using Karma and Jasmine"
				},
				{
					"categories":["ui","angular","management"],
					"content":"Trained developers on AngularJS development and UI best practices"
				},
				{
					"categories":["ui","css","sass","bootstrap"],
					"content":"Implemented  a responsive UI theme using HTML5, CSS/Sass and Bootstrap and libraries like modernizr"
				},
				{
					"categories":["ui","css","sass","bootstrap","material"],
					"content":"Worked with client implementation teams to fix Angular-based Java Portlets with Material design, to help them achieve their delivery dates"
				},
				{
					"categories":["backend","java","ui","management"],
					"content":"Peer Reviewed software commits from other developers, before deploying on demo environments"
				},
				{
					"categories":["backend","java","ui","management","app-sec"],
					"content":"Analyzed security reports comming from the testing team and designed solutions to remediate vulnerabilities"
				},
				{
					"categories":["management","backend","java","ui"],
					"content":"Implemented common design patterns like adapter, facade, decorator, builder and factory method"
				},
				{
					"categories":["backend","java","ui","svn","git"],
					"content":"Worked with source control using both Git and SVN servers"
				},
				{
					"categories":["backend","java","database"],
					"content":"Maintained Hibernate repositories to connect to Oracle Databases"
				}
			]
		},
		{
			"project": "APSP (at Accenture)",
			"startDate": "Nov, 2013",
			"endDate": "Dec, 2014",
			"role": "Java Developer",
			"description": "As a Java Developer, I worked in the update of custom adapters. These adapters decoupled the integration of the application with 3rd party provided products like databases, reporting systems and BPM servers",
			"tags":["java","maven","junit","testing","alfresco-ecm","oracle-ecm","oracle-soa","oracle-db","pentaho-bi","oracle-bi"],
			"responsabilities": [
				{
					"categories":["backend","java"],
					"content":"Implemented new modules in a suite of regression tests to guarantee the adapters back-compatibility"
				},
				{
					"categories":["backend","java","testing"],
					"content":"Implemented unit tests using JUnit to increase code quality and coverage"
				},
				{
					"categories":["backend","java","alfresco-ecm","oracle-ecm","oracle-soa","oracle-db","pentaho-bi","oracle-bi"],
					"content":"Updated adapters for SQL databases like Oracle and MySQL, ECM servers like Oracle ECM, Business Intelligence servers like Pentaho and Oracle BI and BPM productos like Oracle SOA"
				},
				{
					"categories":["backend","java"],
					"content":"Troubleshooted Maven dependency issues"
				},
				{
					"categories":["backend","java"],
					"content":"Worked with SVN for code versioning"
				}
			]
		},
		{
			"project": "Center of Excellence for Security (at Softtek)",
			"startDate": "Sept, 2011",
			"endDate": "Nov, 2013",
			"role": "Security Analyst",
			"description": "As a Security Analyst, I performed security assessments manually and using automated tools. Also, provided training and guidance for developers on vulnerability remediation, threat modeling and secure coding",
			"tags":["fortify","burp","app-sec","threat-modeling"],
			"responsabilities": [
				{
					"categories":["app-sec","testing"],
					"content":"Performed Black, Grey and White box security testing for applications from multiple vendors"
				},
				{
					"categories":["app-sec","testing"],
					"content":"Performed automated static code analysis to detect vulnerabilities using HP Fortify and Burp scanner"
				},
				{
					"categories":["fortify","burp","testing"],
					"content":"Conducted multiple training sessions for software developers in the company to help them understand common vulnerabilities and how to fix them"
				},
				{
					"categories":["app-sec","testing"],
					"content":"Performed automated security tests using HP Fortify. Analyzed the results, removing false positives and adjusting the criticality based on the application context"
				},
				{
					"categories":["app-sec","threat-modeling"],
					"content":"Performed Thread Modeling analysis for clients to help them determine possible security risks in their applications and infrastructure"
				}
			]
		},
		{
			"project": "TDSI Consultoria",
			"startDate": "Sept, 209",
			"endDate": "Sept, 2011",
			"role": "Web Developer",
			"description": "As a Web Developer I used JQuery, ExtJS and Lotus Domino to create web applications",
			"tags":["js","jquery","extjs","lotus-domino","ruby-on-rails"],
			"responsabilities": [
				{
					"categories":["backend","ui"],
					"content":"Used JQuery to perform AJAX requests to backend services exposed by Lotus Domino"
				},
				{
					"categories":["ui"],
					"content":"Created UI modules using HTML, CSS and JavaScript"
				},
				{
					"categories":["backend"],
					"content":"Maintained a Lotus Domino database, to store client records"
				},
				{
					"categories":["backend","ruby-on-rails"],
					"content":"Implemented a proof of concept using Ruby on Rails to create a web application"
				}
			]
		}
	]
}