{
    "project": "Magellan (at Accenture)",
    "startDate": "Dec 2016",
    "endDate": "Oct 2017",
    "startYear": "2017",
    "role": "Senior Full-stack Developer",
    "description": "As a senior developer, I contributed to create [PaaS](https://en.wikipedia.org/wiki/Platform_as_a_service) based applications using micro-services over an AWS infrastructure. I mentored and helped my teammates to complete their user stories successfully and in time. Also, I collaborate with the Architects team to improve the design of our cloud-based infrastructure, implement proofs of concept, document research results, and solve problems which appear during day-to-day development.",
    "tags": [
      "java",
      "nodejs",
      "aws",
      "docker",
      "angular",
      "wso-apimanager",
      "rest",
      "ci/cd",
      "git",
      "agile/scrum",
      "paas",
      "openshift",
      "cloudfoundry",
      "spring",
      "reactjs",
      "cloud",
      "oauth",
      "maven",
      "rabbitmq",
      "mongodb",
      "bash",
      "linux"
    ],
    "responsibilities": [
      {
        "categories": ["management", "agile", "backend", "java", "ui"],
        "content": "Worked under an Agile methodology (Scrum), acting as backup Scrum Master"
      },
      {
        "categories": ["ui", "react", "rxjs", "rest", "backend", "nodejs"],
        "content": "Built an internal ReactJS application with Redux and Rxjs (including its REST API build in NodeJS with Restify) to execute and monitor build jobs in Jenkins"
      },
      {
        "categories": [
          "devops",
          "api-management",
          "aws",
          "rest",
          "backend",
          "linux"
        ],
        "summary": "Implemented an API Gateway",
        "content": " - Exposed REST APIs created with Spring Boot through WSO02 API Gateway\n - Implemented and maintained a cluster of WSO2 products (over AWS EC2 instances running CentOS) including API Manager, Identity Server and Data Analytics\n - Implemented an implicit OAuth2 grant, using the WSO2 Identity Server and AngularJS"
      },
      {
        "categories": ["devops", "aws", "backend", "bash", "linux"],
        "summary": "Administrated Linux servers and multiple Amazon Web Services (AWS) services",
        "content": " - Troubleshooted infrastructure and networking issues on AWS services using EC2, Security Groups, ELB instances and Route 53\n - Troubleshooted AWS services like RDS and Elasticache\n - Created Bash scripts to run as Cronjobs to synchronize configuration files with Rsync, and to guarantee the availability of servers running inside EC2 instances\n - Created and maintained services in PaaS products like Openshift and CloudFoundry"
      },
      {
        "categories": [
          "backend",
          "java",
          "java",
          "spring",
          "microservices",
          "docker",
          "maven",
          "rabbitmq"
        ],
        "summary": "Built Java micro-services with Spring and Docker",
        "content": " - Used Spring Boot, Spring Cloud, Spring Data, Maven, RabbitMQ for asynchronous inter-service communication, and Docker as a deployment unit\n - Implemented Single-Sign-On clients for SAML 2.0 (with Spring Boot MVC) and OpenID Connect (with JavaScript)"
      },
      {
        "categories": [
          "backend",
          "ci/cd",
          "git",
          "openshift",
          "cloudfoundry"
        ],
        "summary": "Maintained a CI/CD flow",
        "content": "Troubleshooted CI/CD pipelines implemented with Jenkins, which build the micro-services in each commit to Git (BitBucket), packaging them in Docker and deploy them to both Openshift and CloudFoundry on the same pipeline."
      },
      {
        "categories": ["backend", "spring", "mongodb", "mysql", "database"],
        "content": "Maintained Spring Data repositories which connect to MySQL and MongoDB"
      },
      {
        "categories": ["management", "ui", "backend", "java"],
        "content": "Trained and mentored other developers in best practices of software development, debugging and infrastructure implementation"
      }
    ]
  }